[
  {
    "uuid": "e1b2c3d4-f5e6-4a5b-8c9d-0e1f2a3b4c5d",
    "location": "Point Pleasant, USA",
    "timeStamp": "12 Feb 2026 at 23:15",
    "title": "The Eyes in the Canopy",
    "text": "I was driving along the old TNT area when my engine sputtered and died. The silence was absolute until I heard a heavy, wet thud on the roof of my car. I looked up through the sunroof and saw two massive, glowing red orbs staring back at me—eyes the size of dinner plates. A pair of leathery wings, spanning at least ten feet, unfurled with a sound like tearing silk. Before I could scream, it launched into the night, leaving deep claw marks in the metal of my roof. They say the Mothman only appears before a disaster; I haven't slept since."
  },
  {
    "uuid": "f2a3b4c5-d6e7-4f8g-9h0i-1j2k3l4m5n6o",
    "location": "Aokigahara, Japan",
    "timeStamp": "15 Nov 2025 at 16:45",
    "title": "The Compass Ghost",
    "text": "The iron in the volcanic soil makes compasses spin wildly here, but that wasn't what scared me. I found a silk ribbon tied to a hemlock tree, used by someone to mark their path back. I followed it, hoping to find a hiker, but the ribbon led me in a perfect, tightening circle. In the center of the loop stood a young man in a school uniform, his back to me. When I called out, he turned around, but he had no face—just smooth, pale skin where his features should be. He pointed deeper into the woods and whispered, 'We are all still here.' I ran until my lungs burned, and I never found that ribbon again."
  },
  {
    "uuid": "g3h4i5j6-k7l8-9m0n-1o2p-3q4r5s6t7u8v",
    "location": "Highgate Cemetery, UK",
    "timeStamp": "31 Oct 2025 at 00:03",
    "title": "The Tall Man of the Circle",
    "text": "I was taking long-exposure photos of the Egyptian Avenue when my camera’s motion sensor triggered. The viewfinder showed a dark blur leaning against a tomb. I blinked, and a figure nearly seven feet tall was suddenly standing just feet away. He wore a high-collared Victorian coat and a top hat that seemed to absorb the moonlight. His skin was the color of wet limestone, and he smelled of damp earth and ancient lilies. He didn't speak, but a cold wind rushed past me, carrying the sound of a thousand whispered 'sorry's. When the flash finally went off, the path was empty. The photo only shows a pillar of grey mist."
  }
]
